
## Plan Result (terraform/env)

[CI link](https://github.com/team-all-in/all-in/actions/runs/10869691688)


<pre><code>Plan: 8 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_apprunner_service.all_in_api_slack
  * aws_ecr_lifecycle_policy.all_in_api_slack
  * aws_ecr_repository.all_in_api_slack
  * aws_iam_policy.slack_access
  * aws_iam_role.slack_access
  * aws_iam_role.slack_app_runner_ssm_role
  * aws_iam_role_policy_attachment.slack_access
  * aws_iam_role_policy_attachment.slack_attach_ssm_policy


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.slack_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "slack_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:BatchGetImage",
              + "ecr:DescribeImages",
              + "ecr:GetDownloadUrlForLayer",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "ReadPrivateEcr"
        }
      + statement {
          + actions   = [
              + "ecr:DescribeImages",
              + "ecr:GetAuthorizationToken",
              + "ssm:DescribeParameters",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "AuthPrivateEcr"
        }
    }

  # aws_apprunner_service.all_in_api_slack will be created
  + resource "aws_apprunner_service" "all_in_api_slack" {
      + arn                            = (known after apply)
      + auto_scaling_configuration_arn = (known after apply)
      + id                             = (known after apply)
      + service_id                     = (known after apply)
      + service_name                   = "all_in"
      + service_url                    = (known after apply)
      + status                         = (known after apply)
      + tags                           = {
          + "Name" = "slack-all-in-apprunner-service"
        }
      + tags_all                       = {
          + "Name" = "slack-all-in-apprunner-service"
        }

      + instance_configuration {
          + cpu               = "0.5 vCPU"
          + instance_role_arn = (known after apply)
          + memory            = "1 GB"
        }

      + source_configuration {
          + auto_deployments_enabled = true

          + authentication_configuration {
              + access_role_arn = (known after apply)
            }

          + image_repository {
              + image_identifier      = (known after apply)
              + image_repository_type = "ECR"

              + image_configuration {
                  + port                          = "8000"
                  + runtime_environment_secrets   = {
                      + "IV"                  = "arn:aws:ssm:ap-northeast-1:451153100141:parameter/all-in-iv"
                      + "KEY"                 = "arn:aws:ssm:ap-northeast-1:451153100141:parameter/all-in-key"
                      + "OPENAI_API_KEY"      = "arn:aws:ssm:ap-northeast-1:451153100141:parameter/openai_api_key"
                      + "SLACK_APP_TOKEN"     = "arn:aws:ssm:ap-northeast-1:451153100141:parameter/slack_app_token"
                      + "SLACK_BOT_TOKEN"     = "arn:aws:ssm:ap-northeast-1:451153100141:parameter/slack_bot_token"
                      + "SLACK_REFRESH_TOKEN" = "arn:aws:ssm:ap-northeast-1:451153100141:parameter/slack_refresh_token"
                    }
                  + runtime_environment_variables = {
                      + "SUPABASE_ANON_KEY" = "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJzdXBhYmFzZSIsInJlZiI6ImNhamptc29wanp2ZXlwbXljd3FlIiwicm9sZSI6ImFub24iLCJpYXQiOjE3MjYyNDY5ODgsImV4cCI6MjA0MTgyMjk4OH0.JrXfH8vNCla4BzoWVbV6IUPOyrg5PoN239qslbb567Q"
                      + "SUPABASE_URL"      = "https://cajjmsopjzveypmycwqe.supabase.co"
                    }
                }
            }
        }
    }

  # aws_ecr_lifecycle_policy.all_in_api_slack will be created
  + resource "aws_ecr_lifecycle_policy" "all_in_api_slack" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 30
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "all_in_api_slack"
    }

  # aws_ecr_repository.all_in_api_slack will be created
  + resource "aws_ecr_repository" "all_in_api_slack" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "all_in_api_slack"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # aws_iam_policy.slack_access will be created
  + resource "aws_iam_policy" "slack_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "apprunner-access-ecr"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.slack_access will be created
  + resource "aws_iam_role" "slack_access" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "build.apprunner.amazonaws.com"
                        }
                      + Sid       = "AccessAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "slack-apprunner_access_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.slack_app_runner_ssm_role will be created
  + resource "aws_iam_role" "slack_app_runner_ssm_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "tasks.apprunner.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "slack-app_runner_ssm_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.slack_access will be created
  + resource "aws_iam_role_policy_attachment" "slack_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "slack-apprunner_access_role"
    }

  # aws_iam_role_policy_attachment.slack_attach_ssm_policy will be created
  + resource "aws_iam_role_policy_attachment" "slack_attach_ssm_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::451153100141:policy/SSMGetParametersPolicy"
      + role       = "slack-app_runner_ssm_role"
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":109,"Program":"tfcmt","SHA1":"ec80bd74ee14a4fd02a4af88c73ab55f92326a88","Target":"terraform/env","Vars":{},"WorkflowName":"pull_request_target"} -->